<template>
    <v-card flat height="85vh" class="overflow-auto">

        <v-card-text>
            <p class="text-justify" :style="getFontSize" >
                Не доезжая около 300 метров до поляны всех первогодок (в том числе и меня - не смотря на то, что в
                России я был на двух фестивалях, тут я считался первогодкой) высадили из автобуса предварительно дав
                переодеться
                в "одежду для марания". Автобус поехал дальше, а мы в сопровождении со старшим, с песней и речевкой
                попеременно, шли на поляну, где нас уже встречали все, кто приехал раньше (а мы приехали почти самые
                последние). Сразу же Феликс Соколов и Игорь Чичкань (кто был на Де(и)снае их знает) обрисовали
                обстановку:
                Мы ученики, которые пришли постигнуть путь самурая. Мы должны сохранять спокойствие в самых сложных
                ситуациях, мы должны передвигаться очень тихо и незаметно и т.д. И вот все наши первогодки сначала
                медитировали, а духи пытались нас вывести из себя. После ползали по-пластунски, затем изучали приемы,
                которые сопровождались громогласными выкриками. В конечном итоге нам сказали, что мы не прошли обучение
                и
                не сдали экзамены, а по закону самураев за это мы должны себе сделать харакири! Выдали нам по бутылочке
                томатного соуса, которыми мы изображали самурайские мечи, тут то и началось представление: таких
                способов
                делать себе харакири, наверняка не знали и сами самураи! Тела падали в общую кучу, возле которой нас уже
                оплакивали. И лишь когда "умер" последний ученик, нам сообщили, что умереть от кетчупа довольно
                проблематично, поэтому все мы оказались живыми, но нас подстерегало новое задание партии. В озере на
                расстоянии 50 метров от берега курсировал вражеский авианосец (какой-то купающийся мужик), который нам
                надо было доблестно потопить. Соорудили самолеты - два парня сцепляют руки в замок, а на руки берут
                бомбу
                (девушка) и вот в таком виде прыгают в озеро пытаясь потопить данный корабль. И вот вся эта эскадрилья
                кидается в озеро, где с криками и воплями бежит бомбить авианосец. Мы победили! После этого выходим на
                берег, где нам уже разрешают обняться со старыми друзьями и поздороваться с еще незнакомыми. Так нас
                встретили на поляне.
            </p>
            <p class="text-justify" :style="getFontSize">
                После того, как мы мокрые и довольные обняли своих старых друзей, команда пошла устанавливать палатки и
                размещаться на поляне, на что в принципе ушла большая часть дня.
            </p>
            <p class="text-justify" :style="getFontSize">
                Питание было организовано централизовано, т.е. готовили еду в Литовской делегации, там же ее и
                употребляли. У них был большой шатер, куда поочередно приглашались команды для принятия пищи. От каждой
                команды выделялись по три человека дежурных, которые целый день проводили в "Литве", где помогали
                готовить
                еду, работали официантами (чтобы избежать общего столпотворения, команда рассаживалась за столы, а
                дежурные раздавали тарелки и кружки, а также добавку по требованию), мыли посуду. А вечером дежурные
                возвращались в лагерь и работали сторожами, когда команда уходила на стыковку или линейку.
            </p>
            <p class="text-justify" :style="getFontSize">
                Вечером первого дня состоялось открытие фестиваля. Открывали его Монахов и Болгаров. Монахов в красивой
                одежде выехал на поляну на лошади. Команда Литвы подготовила небольшой концерт, в основном состоящих из
                танцев, но танцев очень красивых. После концерта был шикарный салют. После линейки наша команда
                собралась
                у себя в лагере, чтобы «пустить комсомолку», для знакомства, так как большую часть людей из команды не
                знал даже я, не говоря уже о тех, кто на подобное мероприятие попал впервые.
            </p>
            <PhotoGridText :photos="[3, 4, 5]" />
            <p class="text-justify" :style="getFontSize">
                Познакомившись с членами команды нам не дали сильно захмелеть, так как снова собрали первогодок и повели
                в
                лес, но там нас вовсе не мучили, как я ожидал, а просто мы помаршировали, попели песни и нас морально
                приготовили к завтрашнему дню.
            </p>
            <p class="text-justify" :style="getFontSize">
                Вернувшись на поляну, мы увидели, что дискотека в самом разгаре. И естественно, что этой ночью
                практически
                никто не спал.
            </p>
            <p class="text-justify" :style="getFontSize">
                Для тех, кто не знает: ежедневно подъем на поляне в 9-00. Поднимают всех. Это обеспечивает гвардия,
                которая ходит по палаткам и вытаскивает чуть живые тела на поляну. Если же находящийся внутри начинает
                ерепениться и сопротивляться, то гвардейцы не церемонятся и просто выливают ведро воды в палатку. После
                такого проходит не только желание спать, но и дальнейшие потуги сопротивляться. Начинается утро с
                зарядки,
                которую проводит команда, которая ведет день. После зарядки все идут на завтрак в порядке, оглашаемом
                командой Литвы.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>