<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                День первогодки начался, как и любой день. После завтрака всех первогодок снова собрали, построили и
                повели по этапам, где мы должны были отгадывать какие-то ребусы, обкидывать сырыми яйцами различных
                духов,
                переправляться через речку по натянутым веревкам, усмирять разбушевавшихся быков, расчищать грязь своими
                телами и т.д. Но больше всего понравилось и запомнилось одно испытание. Все мужики зашли в реку (она там
                примерно по пояс), выстроились в цепочку по двое, образовав таким образом подвесной мост, по которому
                девчонки должны были проползти на другую сторону реки. Сначала все проходило спокойно, но вдруг,
                совершенно неожиданно, подошли сзади два шпиона и начали нас обливать водой, причем вода лилась просто
                как
                цунами. Руки стали мокрыми, скользкими и мы боялись, что выроним какую-нибудь девчонку из наших объятий
                в
                воду. Но все девчонки переправились нормально, а потом нас заставили переправить одного товарища на
                другую
                сторону, но условия несколько изменились. Он не полз, а просто лежал на спине, а мы должны были
                перекидывать его от пары к паре. Вот у одной пары как раз руки и не выдержали, и этот товарищ со всего
                маха полетел в воду. Хорошо, что дно реки песчаное, да и воды достаточно, чтобы не разбиться.
                Переправившись на другой берег, нас ожидало последнее испытание. Мы должны были своими телами расчистить
                грязь с клеенки, под которой были написаны слова, необходимые нам для преодоления всех препятствий.
                Прочитав эти слова, нас признали на поляне, как своих и мы пошли отмываться в озеро. Далее был обед,
                после
                которого первогодки расползлись по лагерям, для того, чтобы приготовиться к концерту первогодок.
                Отрепетировав несколько номеров, мы еще до ужина вышли на поляну, где и состоялся вышеуказанный концерт.
                Без ложной скромности заявляю, что команда России была лучшей. Мы порвали поляну, в прямом и переносном
                смысле. (Кто желает подробностей, прошу обращаться лично).
            </p>
            <p class="text-justify" :style="getFontSize">
                После концерта стали достраивать свой лагерь – возводить фасад, ставить шатер над нашим командным
                столом.
                Вечером ужин и традиционная линейка, на которой подводились итоги прошедшего дня. После линейки у нас
                состоялась стыковка с командой Украины, которая прошла как-то не особо запомнившись. Потом дискотека,
                которая окончилась в 2 часа и все, кто захотел, пошли спать, а остальные как всегда продолжили гулять.
                Так
                прошел второй день на поляне.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>