<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text class="overflow-auto">
            <p class="text-justify" :style="getFontSize">
                В 9 утра выехали с поляны в ЛОК (лечебно-оздоровительный комплекс при АЭС), который находится в лесу,
                примерно в 10 км. от поляны. Там несколько корпусов, в том числе и учебный, в котором находится тренажер
                БЩУ, конференц-зал, подобный нашему в ИАЦ. В этом зале мы и заседали. Открыл симпозиум директор
                Игналинской АЭС, пожелав нам творческих и научных успехов. Далее пошли доклады. Доклады читались только
                на
                английском языке, для тех, кто языка не знает, в этом году был предусмотрен синхронный перевод. Вот и
                сидело пол-зала в наушниках. Всего за день было прочитано 17 докладов. Все доклады отражали специфику
                атомной энергетики. Один раз прерывались на кофе-брейк и один раз на обед. Закончили часа в 4.
            </p>
            <PhotoGridText :photos="[7, 8, 9]" />
            <p class="text-justify" :style="getFontSize">
                После этого нас отвезли в Висагинас, где было 2 часа свободного времени, которое было потрачено на
                брожение по городу и массовое хождение по магазинам.
            </p>
            <PhotoGridText :photos="[10]" />
            <p class="text-justify" :style="getFontSize">
                Вернувшись на поляну, мы узнали, что на поляне жизнь тоже на прекратилась, а оставшиеся придумали себе
                занятие. Они сооружали плоты и катались по озеру. Вечером как обычно линейка, стыковка уже с Литвой, где
                мы повеселились от души. Есть у них в команде уже упомянутый Феликс Соколов, заводной малый. Он
                предложил,
                чтобы стыковка не превратилась в обыкновенную пьянку, показывать какие-нибудь сценки и миниатюрки.
                Сначала
                они показали немного, а потом наш Обнинец Женька Баранов изобразил сказку с действующими лицами их
                команды
                Литвы, вот где мы повеселились по полной программе. Всем понравилось.
            </p>
            <p class="text-justify" :style="getFontSize">
                По-моему, именно в этот день начал работать халява-бар. Это такое заведение, которое организовывают
                хозяева поляны, из названия в принципе все становится ясно. Там наливают какие-то коктейли, жарят блины,
                дают мороженое и др. Но попасть туда не так просто. Для того, чтобы стать счастливчиком, надо было
                выполнить какое-нибудь условие: либо прийти парой, но не просто парой, а изображая из себя каких-нибудь
                животных, соответственно облачаясь в костюмы, либо надо было наносить воды в установленный там бассейн,
                либо участвуя за день в каких-то конкурсах получать приглашения и так далее.
            </p>
            <p class="text-justify" :style="getFontSize">
                Еще, на поляне работала баня. Небольшая, но все-таки, бывало, что умещались там всемером. Там посещение
                было организовано по записи, мы же записывались регулярно и раз в два дня обязательно мылись в бане.
                Баня
                стояла на берегу речки и самый кайф было выскочить из парилки и плюхнуться в довольно холодную воду
                реки.
            </p>
        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>