<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                Заданием на этот день было выборы президента поляны. От каждой команды надо было выдвинуть кандидата на
                пост президента. От нашей команды кандидатом был Евгений Баранов. За день мы прошли и испытали на себе
                весь смысл и принцип избирательной кампании, узнали о способах рекламы и антирекламы кандидатов. Возле
                каждого лагеря была разбита агитационная контора, на которой кандидат с доверенными лицами активно
                агитировал пришедших голосовать за себя. Тут же на доске был вывешен жизненный путь нашего кандидата в
                фотографиях с рождения до сегодняшнего дня. Фотографии были сделаны заранее и привезены с собой, на них
                с
                помощью фотомонтажа был изображен кандидат с различными знаменитостями: Путин, Ельцин, Дж. Буш, Гагарин,
                Че Гевара и др. Было все выполнено на высоком уровне, пришедшему народу очень понравилась эта
                фотогалерея.
                В это время несколько человек осуществляли антирекламу других кандидатов – раздавали листовки с
                порочащими
                их сведениями. Во время завтрака уже начиналась предвыборная кампания, в этот день был нарушен порядок
                командности и приглашали на еду следующим образом: мальчики из одной команды идут есть с девочками из
                другой, которые во время завтрака начинают активно пиарить своего кандидата. Сначала наши девчонки пошли
                с
                хохлами. Не знаю, как они агитировали, но вернувшись с завтрака, они заявили, что украинцы почти
                согласились, что наш кандидат лучше. Потом пошли наши ребята с девчонками из Украины. Нам они сразу
                запретили брать ложки в руки, так как они сами кормили нас с ложечки, одновременно проводя пропаганду и
                раздавая листовки за своего кандидата. Наш же кандидат пришел на завтрак не с пустыми руками, а принес
                каждой девушке по букету (цветы рано утром я с тремя девчонками из команды нарвали в лесу, а собрали в
                букеты уже в лагере).
            </p>
            <PhotoGridText :photos="[11]" />
            <p class="text-justify" :style="getFontSize">
                Каких только способов рекламы мы не увидели в этот день (кое-что можете видеть на фотках, которые я еще
                выложил).
            </p>
            <PhotoGridText :photos="[12, 13, 14, 15]" />
            <p class="text-justify" :style="getFontSize">
                После обеда состоялись дебаты. На сцене кандидаты в сопровождении свиты рассказывали всей поляне свою
                программу, отвечали на вопросы и т.д.
            </p>
            <p class="text-justify" :style="getFontSize">
                Перед тем как идти на ужин, все должны были зайти в избирательный участок, чтобы проголосовать за того
                или
                иного кандидата, причем по правилам дня, голосовать за своего кандидата запрещалось.
            </p>
            <p class="text-justify" :style="getFontSize">
                После линейки объявили победителя – им стал кандидат от команды Интим (International TEAM) представитель
                Словакии, который во время дебатов пытался говорить по-русски (а знал он не более 10 слов), по-английски
                (но английский понимала меньшая часть присутствующих на поляне). В конечном итоге он говорил
                по-словакски,
                который более или менее понятен русскому человеку.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>