<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                На этот день заданием было разыграть сказку "Алиса в стране чудес". Кандидатки на звание мисс от каждой
                команды выступали в роли Алисы, а все остальные – персонажи данной сказки и не только. К примеру, были
                следующие персонажи: Кот в сапогах, Мышка соня, Японцы Тояма и Токанава, рыцари, ковбои, кролики
                всевозможных мастей, даже узбекский Дед Мороз Чих-Пых.
            </p>
            <PhotoGridText :photos="[16, 17, 18, 19, 20, 21, 22]" />
            <p class="text-justify" :style="getFontSize">
                В течение дня мы вместе с Алисой ходили в гости к разным существам, которые, чиня нам преграды,
                заставляли
                что-то делать, выполнять какие-то задания. Алиса должна была рассказать о каждом персонаже, который ее
                сопровождал в походе. Мы играли в крокет, лазили в норку кролика, были на чаепитии. После всего этого
                надо
                было представить нашу Алису на суд зрителей. Это должно было быть какой-то номер: песня, стишок, просто
                сценка. Далее из команд составили хоры цветов, мы были хором одуванчиков (см. фото). После этого наших
                Алис перевели в бассейн с желе, где они повторяли движения одной модели. Было это красиво и
                завораживающе.
                Все представление судило жюри, составленное из мужчин, представителей каждой команды (по одному не
                первогодке от команды). После всех этих конкурсов, на вечерней линейке была объявлена "Мисс
                Диснай-2005".
                Ей стала представительница сборной Украины.
            </p>
            <PhotoGridText :photos="[23, 24, 25]" />
        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>