<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                В предыдущий вечер я рано лег спать, даже не пошел на стыковку. Дело в том, что в день экскурсий я был
                дежурным, а народ на экскурсии разъезжался в восьмом часу, значит, я должен был проснуться в 5, чтобы
                развести костер, чтобы успеть накормить всю поляну до отъезда. Самое противное, что в эту ночь прошел
                единственный за все время нашего пребывания на поляне дождь, а предыдущие дежурные не спрятали дрова под
                навес и они, соответственно намокли. Проснувшись в 5, я только к шести часам смог развести костер, но,
                несмотря на это, завтрак мы приготовили вовремя.
            </p>
            <p class="text-justify" :style="getFontSize">
                Далее все желающие были разделены на две группы: первая ехала в Вильнюс, а вторая отправилась на
                экскурсию
                на Игналинскую станцию. Я был в первой группе. Нам подали автобус и в 8 часов мы выехали к столице
                Литвы.
                Предварительно мы договорились, что поедем посмотреть старинный город-замок Тракай. Но водитель нам
                попался, мягко говоря, не особо дружащий со скоростью и с головой. Во-первых, он ехал не более 80
                км/час,
                потому как быстрее нельзя, а он нарушать правила не хочет. А во-вторых, он совершенно без зазрения
                совести
                проскочил два поворота и километров 25 не мог найти место, где можно развернуться. То есть мы потеряли
                еще
                час только на то, чтобы встать на правильный путь. В конечном итоге мы попали в Тракай. Первое
                впечатление
                – ух и ах, на фотографии я стою на фоне этого замка, зрелище конечно колоссальное. Представьте, стоит
                замок красивый, высокий, со всех сторон окруженный озерами и только один мост соединяет его с сушей.
                Пройдя по этому мосту, мы попадаем в ворота. Ворота, как показывают в исторических фильмах, огромные
                металлические, внушающие уважение и трепет. Войдя в ворота, мы купили билеты, нам выделили экскурсовода,
                которая начала свое повествование, что крепость была возведена в те века, когда Тракай был единственным
                путем с Запада на восток, он пережил немало войн, был несколько раз разрушен и перестроен, и лишь, когда
                открыли другие пути, замок стал летней резиденцией литовского короля. Но, все равно, к началу 20 века от
                замка остались только стены первого этажа, а остальное было сильно разрушено. Тогда-то и было принято
                решение о реконструкции крепости. Интересная деталь, толщина стен в некоторых местах составляет 4 метра.
            </p>
            <PhotoGridText :photos="[26, 27]" />
            <p class="text-justify" :style="getFontSize">
                Войдя во внутренний двор, первое, что мы увидели, это была сцена. Как нам объяснил гид, вчера проходило
                театрализованное представление, где замок выступал в роли декорации в этом спектакле. То есть на сцене
                сидели только музыканты, а актеры ходили по стенам и двору, в том числе вовлекая зрителей в этот
                процесс.
                Еще интересная деталь, напротив сцены находится башня, которая тоже была использована как декорация, на
                нее с помощью лазерной техники проецировали изображение и создавалось впечатление, что эта башня
                охвачена
                огнем.
            </p>
            <PhotoGridText :photos="[40, 28, 30, 31, 32]" />
            <p class="text-justify" :style="getFontSize">
                Мы походили по залам, в которых были представлены экспонаты разных эпох и времен. Еще интересная деталь
                –
                в замке практически нет комнат, которые соединяются друг с другом. Все переходы выполнены в виде
                деревянных мостков на улице (на фото это хорошо видно), это сделано в целях обороны, чтобы враг,
                захватив
                одно помещение, не пробрался в другое.
            </p>
            <PhotoGridText :photos="[33, 34, 35, 36]" />
            <p class="text-justify" :style="getFontSize">
                Также в это время в замке размещалась выставка "Орудия инквизиции и пыток". Вход туда был 4 лита для
                всех
                и 2 лита для студентов. Мы пошли вчетвером: трое русских и один словак. Девушка на входе пыталась
                собрать
                с нас по 4 лита, но мы забили голову, сказав, что мы студенты и вручив ей по два лита, прошли в зал.
                Словак долго удивлялся, почему с него взяли так мало денег, но, получив от нас разъяснение, что он тоже
                студент, успокоился. То, что мы увидели в зале, несколько повергло в шок. Сами машины и приспособления
                были сопровождены рисунками с изображением применения того или иного механизма. Становилось неприятно от
                вида этих машин, но, представив, что ощущал «пациент», сам невольно испытал некоторую судорогу.
            </p>
            <p class="text-justify" :style="getFontSize">
                Перед тем, как зайти в крепость нас предупредили, что собираемся возле автобуса в 3 часа дня.
                Где-то без десяти три, выйдя с выставки инквизиторских машин, мы увидели, что надвигается гроза и начал
                накрапывать дождик, а как я уже говорил, что замок с сушей соединяет мост, протяженностью более 100
                метров, то пока мы дошли до суши влил такой дождь, что мы вымокли в несколько секунд.
                Хорошо, что по пути находятся многочисленные сувенирные лавки, в одну из которых мы завернули.
                Там, как оказалось, уже нашли приют несколько наших.
                Только у одного был зонт, а людей было 8 человек.
                Мы решили, что дождь закончится быстро, и стали ждать, когда можно будет пойти дальше.
                Но дождь прекращаться не собирался, а только увеличивал свою силу.
                Простояв так более получаса, было принято решение купить в этой лавке большой целлофановый мешок,
                разрезав
                его превратить в большую пленку, чтобы, укрывшись под ней вшестером дойти так до автобуса.
                Сначала тренировались идти в ногу прямо в лавке, вроде получалось, но выйдя на улицу, все умение идти
                стройно сразу улетучилось, и задние быстро намокнув, решили не ждать, а просто побежали под дождем до
                автобуса.
            </p>
            <PhotoGridText :photos="[37, 41, 42, 43]" />
            <P class="text-justify" :style="getFontSize">
                Вся остальная наша группа уже сидела в кафешке недалеко от автобуса, ожидая отставших. Дойдя до них, мы
                поняли, что в группе еще не хватает 5 человек. Я взял зонт и пошел в замок, чтобы разыскать их. Тут
                дождь
                прекратился, и я нашел этих людей только на выходе из крепости. Вместо запланированных трех часов, мы
                выехали в Вильнюс только в пятом часу. Приехав туда, мы первым делом пошли в самый крупный гипермаркет в
                Литве, который называется Акрополь. Нам дали три часа, чтобы мы купили необходимое и пообедали. В восемь
                часов желающие поехали смотреть старый город, там побродили и в 10 поехали забирать оставшихся в
                гипермаркете. Только в автобусе, мы обнаружили, что в салоне не хватает двух россиян. Но было это на
                подъезде к Акрополю. Забрав там остальных было принято решение подождать их возле магазина, в надежде,
                что
                они возьмут такси и приедут к нам. В это время стали интенсивно названивать на поляну, чтобы узнать
                номер
                телефона наших отставших, но он был отключен. Прождав полтора часа, мы поехали в старый город, чтобы
                найти
                их там. Только часам к одиннадцати, мы узнали, что эти двое взяв такси, чтобы догнать нас по пути,
                поехали
                не к магазину, а на поляну, куда благополучно добрались раньше нас. Подъехали к поляне мы в 2 часа ночи,
                уставшие, голодные и злые. Так как автобус высаживает всех перед рекой, а оттуда идти еще метров
                четыреста, мы шли по лесу в темноте. Подходя к поляне, мы услышали, что там абсолютно тихо и увидели,
                что
                нигде нет света. Подумав, что все мероприятия уже закончились и все уже разошлись по лагерям, мы решили,
                что останемся голодными. Но тут раздался голос Монахова: "Начинается линейка", включился свет, и мы
                увидели, что возле сцены расставлены столы, на которых нас ждет горячий ужин, и что все стоят вокруг
                сцены
                и ждут нас, не начиная линейки. Нам было очень приятно. Впервые линейку мы наблюдали, одновременно
                употребляя пищу.
            </p>

            <p class="text-justify" :style="getFontSize">
                Но самое ужасное, что в этот день я был дежурным, и я еще с двумя, приехавшими на этом автобусе,
                отправились на кухню мыть посуду. Вымыв всю посуду, мы пошли гулять. Так как следующий день должен был
                быть свободным днем, мы естественно ночь не спали, в надежде отоспаться днем.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>