<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                Скажу сразу – отоспаться нам не дали. Подъем в 9, зарядка, завтрак, и только начал народ разбредаться по
                палаткам, как прозвучала команда о сборе всех на поляне, а, чтобы услышали все, то к этому подключилось
                "мокрое дело" гвардии. Досталось даже мне, хорошо уговорил вытащить из палатки, так что мокрым стал
                только
                я, а палатка осталась сухой. А команда строиться прозвучала не просто так. Кому-то, а, по-моему, это
                Ильгизу стало скучно, и он захотел увидеть "бегающих слоников". На поляне народ засуетился и быстренько
                придумал новую игру. Некая разновидность выбивалок. Вся поляна делится на 2 команды, организовывается
                площадка (чтобы легче было представить вспомните хоккейную – красная линия посередине и синие с двух
                сторон). Строится команда следующим образом. Все члены команды кроме двух человек располагаются между
                красной и синей линией, напротив, за красной линией, стоит другая команда. Оставшиеся двое человек
                располагаются за синей линией, за командой соперника, и соответственно, двое из команды соперника за
                своей
                синей линией. Команда, владеющая мечом, кидает мяч в толпу людей, пытаясь выбить кого-нибудь. Те либо
                уворачиваются, либо, пытаются поймать мяч. Если тебя выбили – ты выходишь из игры (мяч же возвращается
                команде соперника) и направляешься к надувному бассейну, расположенному неподалеку, где тебя поджидает
                гвардия с водой. Ты запрыгиваешь в бассейн, на тебя выливают ведро воды, после этого ты бежишь за водой
                в
                озеро, возвращаешься с полным ведром, отдаешь гвардейцам, заходишь в бассейн и оттуда наблюдаешь за
                баталией на площадке. Если команда ловит мяч, то, во-первых, выходит человек из бассейна на площадку, а
                во-вторых, ход переходит команде, поймавшей мяч. Площадку ограничили не только по длине, но и по ширине.
                Вот и представьте: команда из тридцати человек бегает табуном на маленьком пятачке и естественно, что в
                начале игры выбиваются люди легко, площадки быстро редеют, но бассейн испытывает полный аншлаг. Под
                конец
                в нем стоят все как селедки в бочке, причем выходить из него не разрешают никому, за исключением случая,
                когда твоя команда ловит "свечку" – тогда выходит один человек.
            </p>
            <p class="text-justify" :style="getFontSize">
                Первую партию мы выиграли, вторую проиграли, началась третья – контровая. Правила резко ужесточились:
                стали различать аут, то есть если мяч вылетает от тебя за пределы площадки, то он переходит к команде
                соперника, затем, выбивать можно стало только влет, то есть раньше выбивать можно было от земли, что
                очень
                удобно - противнику тяжелее уклониться от прыгающего мяча, да и к тому же, поймать "свечку" не
                представляется возможным. Короче, третью партию мы тоже выиграли, счет стал 2:1 в нашу пользу. Таким
                образом, мы пробегали пол дня.
            </p>
            <p class="text-justify" :style="getFontSize">
                Вторую половину мы стали готовиться к вечернему закрытию фестиваля и гала-концерту. Вспоминали какие-то
                номера, что-то придумывалось на месте.
            </p>
            <p class="text-justify" :style="getFontSize">
                Единственно со всего фестиваля не понравился гала-концерт. Раньше, на других фестивалях, организаторы
                отбирают в течение всей недели номера, которые будут показываться на галке, расписывается очередность,
                самые сильные ставятся под конец выступления, а здесь получилось так, что в последний день нас попросили
                дать список номеров, которые мы будем показывать, их просто растасовали между собой – так была набита
                программа. Кто будет ведущими не знали до последнего, в итоге назначили совершенно левых людей. В
                результате такого подхода концерт прошел вяло, с большими задержками, но некоторые номера просто спасли
                концерт от полного провала. В заключении концерта были теплые, красивые слова, вручение каких-то призов
                и
                памятных подарков, также вручение номинаций. В завершении был праздничный салют. Если честно, такого
                салюта я еще не видел никогда! То, что бывает у нас в городе на праздниках, не достигает тех высот в
                пиротехническом искусстве, которые показал салют на поляне.
            </p>
            <PhotoGridText :photos="[38]" />
            <p class="text-justify" :style="getFontSize">
                После закрытия была дискотека, которая продолжалась всю ночь. Стоит ли говорить, что в эту ночь не спал
                никто.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>