<template>
    <v-card flat height="85vh" class="overflow-auto">
        <v-card-text>
            <p class="text-justify" :style="getFontSize">
                <b>А теперь начнем. Год 2005 от РХ…</b>
            </p>
            <p class="text-justify" :style="getFontSize">
                Во-первых, все началось с того, что за два месяца до фестиваля мне позвонили и сказали, что я должен
                буду
                поехать на Диснай. До этого у меня не было загранпаспорта, поэтому резко кинулся сдавать документы на
                получение данного документа. Про то, как получался этот паспорт – отдельная история, полная негодования
                и
                матерных выражений.
            </p>
            <p class="text-justify" :style="getFontSize">
                В конечном итоге получил я этот паспорт, но оказалось, что в общую группу Концерна меня уже не включили,
                поэтому визу пришлось оформлять самостоятельно, а это надо ехать в Москву в литовское посольство, а
                через
                пять дней забирать саму визу. Самое интересное было, что на квитанции о сдаче документов есть такая
                очень
                интересная надпись: "Сдача документов не гарантирует получение визы!". Так что ехал в Москву 30 июня в
                ожидании отказа. Но все оказалось хорошо и этот рубеж мы тоже с честью преодолели.
            </p>
            <p class="text-justify" :style="getFontSize">
                И вот сама поездка! Еще в посольстве я изучил список "Норма провоза личных вещей через границу", где
                было
                написано, что пива и водки можно провозить по 0,5 литра на человека, сигарет – 1 блок и т.д. А мы то
                затарились как взрослые, да еще на сайте Десная один товарищ поделился своими впечатлениями о
                пересечении
                границы в недалеком прошлом, и о том, как таможенники шмонали чемоданы в поисках провозимого. Так что
                поездка через границу - это своего рода испытание нервов. Но об этом позднее…
            </p>
            <p class="text-justify" :style="getFontSize">
                Брали билеты на литовский поезд уже за три дня до отправления, поэтому все 24 человека (вся сборная
                России) ехали в разных вагонах в разных купе и на верхних полках. Но одним повезло. Им выпали места в
                одном купе. С ними была еще одна девушка, которую быстренько отправили на другое место, так это купе
                стало
                нашим. В нем поместилось (специально считали) 19 человек!!! А остальные 5 временами выйдут-зайдут. К
                утру
                разошлись по своим койкам. Примерно к 7 часам утра доехали до границы с Литвой. Таможенники почти к
                первым
                из наших попали в купе, где ночью происходила гулянка. Они первым делом спросили: "Водка, сигареты
                имеются?". После чего их пытались угостить тем, что осталось на столе. Так таможенники узнали, что
                молодые
                атомщики едут на фестиваль, и находя по ходу поезда молодых атомщиков старались избежать общения,
                ограничиваясь лишь штампованием паспортов. Таким образом, мы благополучно проехали границу и уже через
                час
                после нее были на вокзале города Вильнюс.
            </p>
            <p class="text-justify" :style="getFontSize">
                Возле вокзала находится обменник, куда мы всей толпой и рванули менять наши рублики на «ихние» литы.
                После
                этого подъехал автобус. Загрузившись в него, мы поехали в какой-то гипермаркет, чтобы затовариться
                продуктами. Одна особенность курсов наших валют: 1 лит = 10 руб. То есть в пересчете их цен на наши
                абсолютно не возникало проблем. Зайдя в магазин, мы были приятно поражены – цены практически на все
                существеннее ниже наших! Там я купил себе трехместную палатку за 46 лит! (460 рублей), а еще там были
                двухместные со скидкой – вовсе 18 лит. Также дешевые спальники и все остальные сопутствующие товары.
                Цены
                на спиртное такие же, как и у нас, а вот цены на сигареты там раза в 4 выше (хорошо, что я некурящий).
            </p>
            <p class="text-justify" :style="getFontSize">
                После магазина мы поехали на поляну. Ехать от Вильнюса до места назначения около 4-х часов.
            </p>

        </v-card-text>
    </v-card>
</template>  

<script>
import { mapGetters } from 'vuex'
import PhotoGridText from '../../components/PhotosgridText.vue'
export default {
    components: {
        PhotoGridText
    },
    computed: {
        ...mapGetters(["getFontSize"]),
    },
}
</script>